export const ARCHITECTURE_KNOWLEDGE = `
研究风水这个问题，如抛开了古人重视风水这一社会基 础，就成无源之水，无本之木。从字面解释，风水的意思，就是 阴、阳宅周围风向水流的形势。晋代郭璞《葬书》说：“葬者，乘 生气也。”经曰：“气乘风则散，界水则止，古人聚之使不散，行 之使有止，故谓之风水。”风水家们认为，宅地周围风水，可导 致住家或葬者一家以及子孙的祸福。从这一认识出发，风水 家们反过头来，又可通过仔细观察人家住宅或墓地周围自然 环境的好坏，来推知住家或葬者一家的吉凶，这就又是由风 水术引发出来的相宅之法了。所以如果从广义来说，风水术 除了指导人们怎样寻找生气结聚的两宅即懂得怎么样辨别自 然环境并确定其原则后，相两宅的吉凶也就迎刃而解，因此 在风水术中，当以寻找生气结聚的最佳自然环境为第一要 义 。
古代传说中，有“禹始肇风水地理，公刘相阴阳，周公置 二十四局，汉王况制五宅姓，管辂制格盘择葬地”的说法。考
 

之实际，至少在战国末年齐、燕一派的方术中，就已有了风水  术的萌芽。然而，风水术的正式兴起，并在社会上广泛流行开  来，则还是在两汉之时。汉武帝时，曾“聚会占家问之，某日可  取妇乎”?结果“五行家曰可，堪舆家曰不可，建除家曰不吉， 丛辰家曰大凶，历家曰小吉，天人家曰小吉，太一家曰大吉”。 由于“辩讼不决”,最后不得不“以状闻”。制曰：“避诸死忌，以  五行为主。”主张选日的堪舆家，和主张“大举九州之势，以立  城廓室舍形，人及六畜骨法之度数，器物之形容，以求其声气  贵贱吉凶”的形法家，由于在各自的实际活动中关系密切，所  以日子长就慢慢合而为干，成了风水家了。东汉以后，风水  术在社会上大为流行，所以风水家也就称为堪舆家了。关于  两家合并以前的著作，形法家有《宫宅地形》二十卷，堪舆家  有《堪舆金匮》十四卷。直到后来，清代钱大昕《恒言录》卷六  还认为：“古堪舆家即今选择家，近世乃以宅相图墓者当之。”
,其实，说得明白一点，风水术就是一门建筑学土有关选 择土地环境，旁及方位、择日的学问。
因为古人非但重视生前住屋，并且重视死后择葬，所以 从总体来说，风水术的服务对象，就是阴宅和阳宅。
网 由人活着要住屋，这在风水术中叫做阳宅。《黄帝宅经 ·总  论》说：“凡之阳宅，即有阳气抱阴；阴宅，即有阴气抱阳，原因  是这是一处不利居住的凶宅。虽说纪晓岚平时不很信风水， 认为一个人的吉凶主要来自平时为人是善是恶，可对于凶宅  这件事，他还是很坚信的。根据现代科学分析，古代所说的凶 宅，大多地处险恶，长期受不到阳光的照射，且又不通空气， 这样便就自然造成一种阴沉而不利于人居住的室内环境，从  而形成凶宅。
 
我国古代风水术起源，对于阳宅的风水讲究；早于阴宅 的风水。唐朝吕才《五行禄命葬书论》说：“逮乎殷周之际，乃  有卜宅之文，故《诗》称‘相其阴阳’,《书》云‘卜惟洛宅’,此则 卜宅吉凶，其来尚矣。”可见卜宅吉凶的阳宅风水，早在殷周 时期，就已有了萌芽了。至于有关阴宅风水的记载，《史记 ·  樗里子传》说：“昭王七年，樗里子卒，葬于渭南章台之东，曰： ‘后百岁，是当有天子之宫夹我墓。”樗里子疾，其室在于昭王  庙西渭南阴乡樗里，故俗谓之樗里子。至汉兴，长乐宫在其  东，未央宫在其西，武库正直其墓。秦人谚曰：‘力则任鄙，智  则樗里。”樗里子名疾，是秦惠王的异母弟弟。由于平时滑稽  多智，人家都把他叫作“智囊”。这就是“后百岁，是当有天子  之宫夹我墓”的有关宫墓的预言，使樗里子成了后世阴宅风 水术的隐约远祖。
其实严格说起来，风水术的真正兴起，还是汉和汉以后  的事，今传《青乌先生葬经》,据说就是汉时青乌先生的遗著。 又据《后汉书 ·来历传》说：“安帝时，皇太子病惊不安，嬖幸  乳母野王君主圣舍。太子厨监那吉以为圣舍新缮修，犯上禁， 不可久御。”同书《袁安传》也说：“初安父没，母使安访求葬  地。道逢书生，问安何之?安为言其故，生乃指一处云：‘葬此 地，当世为上公。’须臾不见。安异之，于是遂葬其所占之地， 故累世隆盛焉。”可见有关风水吉凶的说法，两汉之时已经成  为流布于宫中和民间了。
魏晋南北朝以降，风水之术一时大行。《魏书 · 管辂传》 说：“辂随军西行，过勿丘俭墓下，倚树哀吟，精神下乐。人问  其故，辂曰：树木虽茂，无形可久；碑诛虽美，无后可守。无武  藏头，苍龙无足，白虎衔尸，朱雀悲哭。四危以备，法当灭族，
 
不过二载，其应至矣，卒如其言。”这里管辂相墓的灵验，可谓 神乎其技。而这种相墓，以至相宅术的产生，正是建立在阴阳 宅风水基础上的。   留《 隋书 · 经籍志》记载，当时有关风水著述，继东晋郭璞 《葬书》以后，又有《宅吉凶论》三卷，《相宅图》三卷，《五姓墓 图》 一卷等多种问世。唐宋以后，有关这方面的著作，就好比 雨后春笋似的越来越多了。
其  和风水术专著同时并行的，尚有以议论文形式出现，兼 可视作文学作品的众多有关论述风水的篇章。其中如魏时嵇 康《难宅无吉凶摄生论》、《答释难宅无言凶摄生论》,唐代吕才 《五行禄命葬书论》,元代赵芳《葬书问对》、《风水选择序》,明 代吴翰《风水问答》。“阴气抱阳。阴阳宅者，即龙也。”《水龙经
·总论》也说：“若只取大荡，阳宅尚有归收，阴墓必难乘按。”
对于阳宅的重要，《黄帝宅经 ·序》明确指出：“夫宅者， 乃是阴阳之枢纽，人伦之轨横，非夫博物明贤，未能悟斯道  也。就此五种，其最要者，唯有宅法为真秘术。”接着又说：“凡  人所居，无不在宅，虽只大小不等，阴阳有殊，纵然客居一室  之中，亦有善恶。大者大说，小者小论。犯者有灾，镇而祸止， 犹药病之效也。”为此，结论是：“故宅者人之本，人以宅为家。 若安，即家吉昌；若不安，即门族衰微。坟墓川冈，并同兹说。 上之军国，次及州郡县邑，下之村坊署栅，乃至山居。但人所  处，皆其例焉。目见耳闻，古制非一。”
因为有着这种“宅者人之本，人以宅为家。若安，即家代 吉昌，若不安，即门族衰微”的传统说法，所以自古以来，人们 对于阳宅风水的好坏，寄予了十二分的重视。《晋书 · 魏舒 传》记载，魏舒幼年丧父，寄养在外祖父母的家里，后来“宁氏
 
起宅，相宅者云当出贵甥”。外祖父母见魏舒年幼聪慧，认为 一定会应相宅者所说的话。魏舒也说：“当为外氏，成此宅 相。”这里，魏舒的意思虽然是说，我长大后要好好努力，干一 番事业，以证实舅氏门宅当出贵甥的相法，并且从此以后， “宅相”还成了外甥的代称，可在另一方面，却为我们道出了 当时相宅风气的盛行，和人们对居宅风水的重视。
在古人的眼里，这种阳宅风水的好坏，直接关系到“家代 吉昌”或“门族衰微”的说法，并不是什么耸听的危言。在《晋 书》里，还另有上党鲍瑗家因为“安宅失宜”,而多丧祸贫苦的 一则记载。当时，鲍瑗被丧祸贫困搅扰得焦头烂额，不知道是 什么原因引起的，便去请教淳于智。淳于智占卜后，根据所得 卦象说：“为君安宅者，女子工耶?”鲍瑗回答：“是也。”淳于智 又问：“此人已死耶?”鲍瑗回答：“然。”接着，淳于智说：“此人 安宅失宜，既害其身，又令君不利。宅东北有大桑树，君径入 市门数十步，当有一人折新马鞭者，请买还，悬此三年，当得 物。”鲍瑗听了他的话，前去市上买来马鞭，把它挂在大桑树 上三年。后来鲍瑗浚井，“得钱十万铜钱，杂器复可二十余 万”,于是家道中兴。
文献记载，三国时，吴国孙皓流徙丁奉一家。到了晋朝， 丁家的旧宅先后住过的有周凯、苏峻、袁真、司马秀等大户人  家，然而“凶败”。此后，又由臧焘去住，“亦频遇丧祸”,所以当  时有个名叫王富绰的人，平时“常以正达自居”,认为“宅无吉  凶，请为宅，未经择吉，即造筑，结果未居而败。”
为了望知人家宅第的吉凶，《地境图》“望百家宅法”的说 法，很有趣，书说：“有赤气者，家有泛财。白气入人家，有财不 保。黑气有五，其伏在宅中。青气者，有银，地宝也。”
